Autodesk.Revit.DB.ISiteInsertServerProxy.Insert(Autodesk.Revit.DB.SiteInsertServiceData)
The method that Revit will invoke to perform site insert.
data:
The site insert data.
Returns:
Indicates whether the site insert server is executed successfully.
Since:
2018